Project/Toir/src/InformationRegisters/торо_Последствия/торо_Последствия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Последствия</name>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектВоздействия</name>
    <type>
      <types>CatalogRef.торо_ОбъектыВоздействия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияТяжести</name>
    <type>
      <types>CatalogRef.торо_КатегорииТяжестиПоследствий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/торо_КатегорииТяжестиПоследствий/торо_КатегорииТяжестиПоследствий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_КатегорииТяжестиПоследствий</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/торо_Последствия/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ПолучитьФункциональнуюОпцию("торо_НазначениеНаРемонтСУчетомРисков")Тогда
		Элементы.ТаблицаНастроек.Видимость                  = Ложь; 
		Элементы.ФормаОчиститьДанные.Доступность            = Ложь;
		Элементы.ФормаЗагрузитьИзКлассификатора.Доступность = Ложь;
		Элементы.ФормаОбновить.Доступность                  = Ложь;
	Иначе 
		ВозможностьРедактировать = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.торо_Последствия);
		Элементы.ФормаОчиститьДанные.Доступность            = ВозможностьРедактировать;
		Элементы.ФормаЗагрузитьИзКлассификатора.Доступность = ВозможностьРедактировать;
		Элементы.ФормаОбновить.Доступность                  = ВозможностьРедактировать;
		Элементы.ТаблицаНастроек.ТолькоПросмотр             = Не ВозможностьРедактировать;
		ЗаполнитьФормуДаннымиНаСервере();
	КонецЕсли; 
	
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте 
Процедура ПриИзмененииОписания(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаНастроек.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		
		ИмяКолонки = СтрЗаменить(Элемент.Имя,"ТаблицаНастроек","");
		
		ОбъектВоздействияСтроки = ТаблицаИменКолонок.НайтиСтроки(Новый Структура("ИмяКолонки", ИмяКолонки));
		
		Если ОбъектВоздействияСтроки.Количество() > 0 Тогда
			
			Отказ = Ложь;
			
			КатегорияТяжести  = ТекущиеДанные.КатегорияТяжестиПоследствия;
			ОбъектВоздействия = ОбъектВоздействияСтроки[0].ОбъектВоздействия;
			
			СохранитьНастройкуНаСервере(ОбъектВоздействия, КатегорияТяжести, ТекущиеДанные[ИмяКолонки], Отказ);
			
		КонецЕсли;
		
	КонецЕсли; 
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчиститьДанные(Команда)
	
	ТекстВопроса = "Данные регистра будут полностью удалены. Продолжить?";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПередОчисткойДанных", ЭтаФорма);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Да, НСтр("es='La limpieza de los datos del registro de los ajustes';ru='Очистка данных регистра настроек';en='Clearing settings register data'"), КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзКлассификатора(Команда)
	
	ТекстВопроса = "Данные регистра будут перезаполнены. Продолжить?";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтветаЗагрузитьИзКлассификатора", ЭтаФорма);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Да, НСтр("es='La carga de los datos del clasificador';ru='Загрузка данных из классификатора';en='Loading data from the classifier'"), КодВозвратаДиалога.Да);

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьФормуДаннымиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура ВопросПередОчисткойДанных(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьДанныеНаСервере();
	КонецЕсли; 	
КонецПроцедуры
 
&НаКлиенте 
Процедура ОбработкаОтветаЗагрузитьИзКлассификатора(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗагрузитьИзКлассификатораНаСервере();	
	КонецЕсли; 	
КонецПроцедуры
 


&НаСервереБезКонтекста 
Процедура СохранитьНастройкуНаСервере(ОбъектВоздействия, КатегорияТяжести, Описание, Отказ)
	
	МенеджерЗаписи = РегистрыСведений.торо_Последствия.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОбъектВоздействия = ОбъектВоздействия;
	МенеджерЗаписи.КатегорияТяжести  = КатегорияТяжести;
	МенеджерЗаписи.Прочитать();

	Если МенеджерЗаписи.Выбран() Тогда
		СтароеОписание = МенеджерЗаписи.Описание;
	Иначе
		СтароеОписание = "";
		МенеджерЗаписи.ОбъектВоздействия = ОбъектВоздействия;
		МенеджерЗаписи.КатегорияТяжести  = КатегорияТяжести;
	КонецЕсли; 
	
	
	Если Не ЗначениеЗаполнено(Описание) Тогда
		
		Попытка
			МенеджерЗаписи.Удалить();
		Исключение
			
			ТекстСообщения = НСтр("es='No consiguió quitar la anotación';ru='Не удалось удалить запись';en='Failed to delete entry.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
			Описание = СтароеОписание;
			
		КонецПопытки; 
		
	КонецЕсли; 
	
	Если Не Отказ Тогда
		
		МенеджерЗаписи.Описание = Описание;
		
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
			
			ТекстСообщения = НСтр("es='No consiguió cumplir la anotación';ru='Не удалось выполнить запись';en='Failed to write down'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
			Описание = СтароеОписание;
			
		КонецПопытки; 
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуДаннымиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_Последствия.ОбъектВоздействия КАК ОбъектВоздействия,
	               |	торо_Последствия.КатегорияТяжести КАК КатегорияТяжести,
	               |	торо_Последствия.Описание КАК Описание
	               |ИЗ
	               |	РегистрСведений.торо_Последствия КАК торо_Последствия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_ОбъектыВоздействия.Ссылка КАК Ссылка,
	               |	торо_ОбъектыВоздействия.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.торо_ОбъектыВоздействия КАК торо_ОбъектыВоздействия
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_КатегорииТяжестиПоследствий.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.торо_КатегорииТяжестиПоследствий КАК торо_КатегорииТяжестиПоследствий
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	торо_КатегорииТяжестиПоследствий.РеквизитДопУпорядочивания";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[1].Пустой()
		ИЛИ РезультатЗапроса[2].Пустой() Тогда
		
		Если РезультатЗапроса[1].Пустой() Тогда
			ТекстСообщения = НСтр("es='>';ru='Не заполнен справочник <Объекты воздействия>';en='The reference book <Объекты воздействия> is not filled'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
		
		Если РезультатЗапроса[2].Пустой()  Тогда
			ТекстСообщения = НСтр("es='>';ru='Не заполнен справочник <Категории тяжести последствий>';en='Handbook <Категории тяжести последствий>'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
		
		Возврат;
		
	КонецЕсли; 
	
	ОчиститьКолонки();
	
	МассивДобавляемых = Новый Массив;
	СчИменКолонок = 0;
	
	ВыборкаВоздействие = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаВоздействие.Следующий() Цикл
		
		ИмяКолонки = "Колонка" + СчИменКолонок;
		СчИменКолонок = СчИменКолонок + 1;
		
		НС = ТаблицаИменКолонок.Добавить();
		НС.ОбъектВоздействия = ВыборкаВоздействие.Ссылка;
		НС.ИмяКолонки        = ИмяКолонки;
		НС.Заголовок         = ВыборкаВоздействие.Наименование;
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)), "ТаблицаНастроек", НС.Заголовок);
		
		МассивДобавляемых.Добавить(НовыйРеквизит);
		
	КонецЦикла; 
	
	ИзменитьРеквизиты(МассивДобавляемых);
	
	Для каждого Строка Из ТаблицаИменКолонок Цикл
		КолонкаВоздействие = Элементы.Добавить("ТаблицаНастроек" + Строка.ИмяКолонки, Тип("ПолеФормы"), Элементы.ТаблицаНастроек);
		КолонкаВоздействие.ПутьКДанным = "ТаблицаНастроек." + Строка.ИмяКолонки;
		КолонкаВоздействие.Вид = ВидПоляФормы.ПолеВвода;
		КолонкаВоздействие.УстановитьДействие("ПриИзменении", "ПриИзмененииОписания");
	КонецЦикла; 
	
	
	ВыборкаКатегорииТяжести = РезультатЗапроса[2].Выбрать();
	ВыборкаНастройки        = РезультатЗапроса[0].Выбрать();
	
	Пока ВыборкаКатегорииТяжести.Следующий() Цикл
		
		ВыборкаНастройки.Сбросить();
		
		НС = ТаблицаНастроек.Добавить();
		НС.КатегорияТяжестиПоследствия = ВыборкаКатегорииТяжести.Ссылка;
		
		СтруктураОтбора = Новый Структура("КатегорияТяжести", ВыборкаКатегорииТяжести.Ссылка);
		
		Пока ВыборкаНастройки.НайтиСледующий(СтруктураОтбора) Цикл
			ИмяКолонкиСтроки = ТаблицаИменКолонок.НайтиСтроки(Новый Структура("ОбъектВоздействия", ВыборкаНастройки.ОбъектВоздействия));
			
			Если ИмяКолонкиСтроки.Количество() > 0 Тогда
				НС[ИмяКолонкиСтроки[0].ИмяКолонки] = ВыборкаНастройки.Описание;
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры
 
&НаСервере
Процедура ОчиститьКолонки()
	
	МассивУдаляемых = Новый Массив;
	
	Для каждого Реквизит Из ПолучитьРеквизиты("ТаблицаНастроек") Цикл
		
		Если Реквизит.Имя = "КатегорияТяжестиПоследствия" Тогда
			Продолжить;
		КонецЕсли; 
		
	    МассивУдаляемых.Добавить(Реквизит.Путь + "." + Реквизит.Имя);
		
		Элементы.Удалить(Элементы["ТаблицаНастроек" + Реквизит.Имя]);
		
	КонецЦикла; 
	
	ТаблицаИменКолонок.Очистить();
	ТаблицаНастроек.Очистить();
	
	ИзменитьРеквизиты(, МассивУдаляемых);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеНаСервере()
	
	НаборЗаписей = РегистрыСведений.торо_Последствия.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	Для каждого Строка Из ТаблицаНастроек Цикл
		
		Для каждого ИмяКолонкиСтрока Из ТаблицаИменКолонок Цикл
			Строка[ИмяКолонкиСтрока.ИмяКолонки] = "";
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзКлассификатораНаСервере()

	РегистрыСведений.торо_Последствия.ЗагрузитьИзКлассификатора();	
	ЗаполнитьФормуДаннымиНаСервере();
	
КонецПроцедуры

#КонецОбласти
